EDT/УТ/src/DataProcessors/ПечатьСервисныхШтрихкодовТСД/ПечатьСервисныхШтрихкодовТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьСервисныхШтрихкодовТСД</name>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/НастройкиОперацийТСД/НастройкиОперацийТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОперацийТСД</name>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихкодСтр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РежимАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеЯвляетсяРежимомТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПользователиТСД/ПользователиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиТСД</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/DataProcessors/ПечатьСервисныхШтрихкодовТСД/ObjectModule.bsl
Процедура Сформировать() Экспорт
	Таб = Новый ТабличныйДокумент;
	
	Мак = ПолучитьМакет("Макет");
	
	Обл = Мак.ПолучитьОбласть("Строка");
	
	Выб = РегистрыСведений.НастройкиОперацийТСД.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Не Выб.РежимАктивен Тогда
			Продолжить;
		КонецеСли;	
		Обл.Параметры.Операция = Выб.Операция;
		Обл.Рисунки.D1.Объект.barcode = Выб.Штрихкод;
		Таб.Вывести(Обл);
	КонецЦикла;	
	
	Выб = РегистрыСведений.ПользователиТСД.Выбрать();
	Пока Выб.Следующий() Цикл
		Обл.Параметры.Операция = Выб.Пользователь.Наименование;
		Обл.Рисунки.D1.Объект.barcode = Выб.Пароль;
		Таб.Вывести(Обл);
	КонецЦикла;	
	
	
	Таб.ПолеСверху = 3;
	Таб.ПолеСлева = 3;
	Таб.ПолеСправа = 3;
	Таб.ПолеСнизу = 3;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Таб.Показать();
КонецПроцедуры
